[
  {
    "postId": "1km4928",
    "postUrl": "https://reddit.com/r/dataengineering/comments/1km4928/how_much_are_you_paying_for_your_data_catalog/",
    "postTitle": "How much are you paying for your data catalog provider?",
    "author": "data_platform_leader",
    "fitScore": "high",
    "who": "data_platform_leader",
    "matched_signals": [
      "Actively comparing Atlan, DataHub, Informatica, and Collibra",
      "Seeking pricing transparency and usage metrics",
      "Evaluating based on satisfaction and value"
    ],
    "rationale": [
      "Direct evaluation of Atlan against competitors indicates active buying process.",
      "Request for pricing and satisfaction data shows budget authority and decision-making role.",
      "Leadership involvement suggests enterprise-level decision with significant budget."
    ],
    "comment": "We went through a similar vendor bake-off. One thing that helped was looking beyond license cost to actual adoption metrics (e.g. weekly active users, glossary contributions). Atlan stood out for us because analysts actually used it thanks to Slack/BI tool integrations and intuitive lineage views. Might be worth testing that if you're running a trial — https://atlan.com."
  },

  {
    "postId": 
    "1dxfgm6",
    "postUrl": 
    "https://reddit.com/r/dataengineering/comments/1dxfgm6/data_management_operational_challenges/",
    "postTitle": 
    "Data management operational challenges",
    "author": 
    "principal_data_engineer",
    "fitScore": 
    "medium",
    "who": 
    "principal_data_engineer",
    "matched_signals": 
    [
    "Mentions Atlan among tools",
    "Evaluating build vs buy option",
    "Operational challenges with pipelines"
    ],
    "rationale": 
    [
    "Principal Data Engineer looking to resolve failing pipelines and improve internal data collaboration.",
    "Actively researching tools including Atlan, indicating interest in modern data management and potential metadata solutions.",
    "Evaluating build vs buy suggests a careful procurement process, making this a moderate fit for enterprise governance tooling."
    ],
    "comment": 
    "We were in a similar place — tons of engineering hours lost to pipeline firefighting and repeated Slack DMs about table meanings. One thing that helped was centralizing context + lineage so internal teams could self-serve answers and see impacts before making schema changes. We went with Atlan (https://atlan.com) since it integrates cleanly with dbt/Snowflake and handles metadata + PII tagging out of the box, which saved us from custom builds. If you're leaning buy, it’s worth piloting before you commit to build-from-scratch engineering overhead."
    },
    {
    "postId": 
    "19aeowz",
    "postUrl": 
    "https://reddit.com/r/dataengineering/comments/19aeowz/do_you_think_data_engineers_should_have_point/",
    "postTitle": 
    "Do you think Data Engineers should have point solutions for Data Observability and Catalog OR prefer a consolidated solution which is seamlessly integrated?",
    "author": 
    "de4all",
    "fitScore": 
    "medium",
    "who": 
    "data_engineer",
    "matched_signals": 
    [
    "mentions Atlan",
    "compares GE + Open-Metadata",
    "discusses unified vs point solutions"
    ],
    "rationale": 
    [
    "The post discusses the tension between separate point solutions for data observability and a consolidated solution, a key issue in enterprise metadata strategy.",
    "It includes mention of Atlan and comparisons with other tools, aligning with enterprise evaluations and active metadata market discussions.",
    "While the engagement shows interest in integrated solutions, it lacks explicit signals of enterprise-wide governance mandates or large-scale implementations, leading to a medium fit."
    ],
    "comment": 
    "Totally hear you — we've dealt with connector gaps and messy handoffs between catalog and observability tools too. One thing that helped us was moving to a platform where lineage, quality, and glossary context all live together — we use Atlan (https://atlan.com) for that reason and it’s saved us from having to awkwardly glue GE outputs into another system."
    }
]